/*******************************************************************************
 * Name        : lib_circularqueue.h
 * Author      : Jung-Hoo Moon
 * Version     : 1.0
 * Date        : 2022-07-27
 * Description : Circular Queue - Header File
 ******************************************************************************/

/**
 * @file   lib_circularqueue.h
 * @author Jung-Hoo Moon
 * @date   2022/07/27
 * @brief  원형큐 자료구조 라이브러리 헤더 파일
 */

#ifndef __LIB_CIRCULARQUEUE_H__
#define __LIB_CIRCULARQUEUE_H__

/*******************************************************************************
 * Includes
 ******************************************************************************/
// C-Standard Library
#include <stdint.h>
#include <stdbool.h>

// MCU Driver

// User Library

/*******************************************************************************
 * Define
 ******************************************************************************/
/**
 * @brief 원형큐 구조체의 버퍼 최대 크기
 */
#define CQUEUE_MAX_SIZE 2048

/*******************************************************************************
 * Macro
 ******************************************************************************/

/*******************************************************************************
 * Typedef
 ******************************************************************************/
/**
 * @brief 원형큐 데이터 타입
 */
typedef uint8_t element;

/*******************************************************************************
 * Enum
 ******************************************************************************/
/**
 * @brief 원형큐 상태
 */
typedef enum eState_CQueue
{
	CQUEUE_SUCCESS, /**< 성공 */
	CQUEUE_FULL,    /**< 버퍼가 가득차 있는 상태 */
	CQUEUE_EMPTY    /**< 버퍼가 비어져 있는 상태 */
} State_CQueue;

/*******************************************************************************
 * Structure
 ******************************************************************************/
/**
 * @brief 원형큐 구조체
 */
typedef struct stCQueue
{
	element  queue[CQUEUE_MAX_SIZE]; /**< 원형큐 버퍼 */
	uint16_t front;                  /**< 데이터 출력 인덱스 */
	uint16_t rear;                   /**< 데이터 입력 인덱스 */
	uint16_t size;                   /**< 원형큐의 현재 데이터 개수 */
} CQueue;

/*******************************************************************************
 * Variable
 ******************************************************************************/

/*******************************************************************************
 * Public Function Prototype
 ******************************************************************************/
void         CQueue_Init(CQueue *p_CQueue);
bool         CQueue_IsEmpty(CQueue *p_CQueue);
bool         CQueue_IsFull(CQueue *p_CQueue);
State_CQueue CQueue_Enqueue(CQueue *p_CQueue, element item);
State_CQueue CQueue_Dequeue(CQueue *p_CQueue, element *p_item);
uint16_t     CQueue_GetSize(CQueue *p_CQueue);

#endif /* __LIB_CIRCULARQUEUE_H__ */
